haymanmk/stm32f767zi_freeRTOS_first_project/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "stm32f7xx_timer_extension.h"
#include "double_buffer_mem_manage.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define VECT_TAB_OFFSET 0x00100000U // Vector Table base offset field.
#define STACK_SIZE configMINIMAL_STACK_SIZE
#define APB1_CLOCK 108000000    // Hz
#define NVIC_NUM_INTERRUPTS 110 // Number of interrupts in NVIC, 0-109

/**
 * @brief FreeRTOS Task Notify Value for updating pulse frequency
 *
 * The notify value is a 32-bit value which will be split into 2 parts:
 * - The lower 16 bits is the channel ID of the timer
 * - The higher 16 bits is the buffer ID of the double buffer
 */
// Timer Channel ID, 1, 2, 3, 4
#define TASK_NOTIFY_TIM_CHANNEL_1 0x01
#define TASK_NOTIFY_TIM_CHANNEL_2 0x02
#define TASK_NOTIFY_TIM_CHANNEL_3 0x03
#define TASK_NOTIFY_TIM_CHANNEL_4 0x04

// Double Buffer ID, 0 or 1
// The buffer ID is used to identify which buffer should be updated
#define TASK_NOTIFY_BUFFER_ID_OFFSET 16 // bit offset
#define TASK_NOTIFY_BUFFER_ID_0 0x00 << TASK_NOTIFY_BUFFER_ID_OFFSET
#define TASK_NOTIFY_BUFFER_ID_1 0x01 << TASK_NOTIFY_BUFFER_ID_OFFSET

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define COMPUTE_INCREMENT_FOR_PULSE(pulse_freq, clock_freq) ((uint32_t)((uint32_t)clock_freq / ((uint32_t)pulse_freq * 2)))

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

TIM_HandleTypeDef htim5;
DMA_HandleTypeDef hdma_tim5_ch1;
DMA_HandleTypeDef hdma_tim5_ch4_trig;

/* USER CODE BEGIN PV */
TaskHandle_t xHandleTask1 = NULL;
TaskHandle_t xHandleTask2 = NULL;
TaskHandle_t xHandleUpdatePulseData = NULL;

// Pulse frequency
volatile uint32_t pulseFrequency = 200000;

// Double Buffer Space
static doubleBufferArray_t *preparingBufferCh1 = NULL;
static doubleBufferArray_t *preparedBufferCh1 = NULL;
static doubleBufferArray_t *preparingBufferCh4 = NULL;
static doubleBufferArray_t *preparedBufferCh4 = NULL;
volatile doubleBufferArray_t *freeBufferCh1 = NULL;
volatile doubleBufferArray_t *freeBufferCh4 = NULL;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM5_Init(void);
/* USER CODE BEGIN PFP */
void updateBuffer(doubleBufferArray_t *buffer, uint32_t start_index, uint32_t start_value, uint32_t increment, size_t length);
void bootloaderJumpToApp(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void vMainTask(void *pvParameters)
{
  uint32_t lastPulseCountCh1 = (*preparingBufferCh1)[DOUBLE_BUFFER_SIZE - 1];
  uint32_t lastPulseCountCh4 = (*preparingBufferCh4)[DOUBLE_BUFFER_SIZE - 1];

  // Start TIM5 Output Compare Mode at Channel 1 and Channel 4
  TIM_OC_Start_DMA_Double_Buffer(&htim5, TIM_CHANNEL_1, (uint32_t)(*preparedBufferCh1), (uint32_t)(&htim5.Instance->CCR1), (uint32_t)(*preparingBufferCh1), DOUBLE_BUFFER_SIZE);
  // TIM_OC_Start_DMA_Double_Buffer(&htim5, TIM_CHANNEL_4, (uint32_t)(*preparedBufferCh4), (uint32_t)(&htim5.Instance->CCR4), (uint32_t)(*preparingBufferCh4), DOUBLE_BUFFER_SIZE);

  preparedBufferCh1 = NULL;
  preparingBufferCh1 = NULL;

  // Reset TIM5 Counter
  __HAL_TIM_SET_COUNTER(&htim5, 0);

  for (;;)
  {
    // do something
    if(freeBufferCh1 != NULL)
    {
      freeNode(&freeBufferCh1, CH1);
    }

    if (preparingBufferCh1 == NULL)
    {
      getFreeNode(&preparingBufferCh1, CH1);

      // check if buffer is available
      if (preparingBufferCh1 == NULL)
      {
        // No buffer is available
        // in practice, the pulse generation should be stopped
        return;
      }

      // prepare data for buffer
      uint32_t pulseIncrement = COMPUTE_INCREMENT_FOR_PULSE(pulseFrequency, APB1_CLOCK);
      updateBuffer(preparingBufferCh1, 0, lastPulseCountCh1 + pulseIncrement, pulseIncrement, DOUBLE_BUFFER_SIZE);

      // update last pulse count
      lastPulseCountCh1 = (*preparingBufferCh1)[DOUBLE_BUFFER_SIZE - 1];
    }

    if (preparedBufferCh1 == NULL)
    {
      preparedBufferCh1 = preparingBufferCh1;
      preparingBufferCh1 = NULL;
    }
  }
}

void vBootloaderTask(void *pvParameters)
{
  for (;;)
  {
    if (HAL_GPIO_ReadPin(USER_Btn_GPIO_Port, USER_Btn_Pin) == GPIO_PIN_SET)
    {
      // Bootloader mode
      vLoggingPrintf("Bootloader mode is enabled\n");

      // Jump to user application
      bootloaderJumpToApp();
    }
    else
    {
      vLoggingPrintf("Bootloader mode is disabled\n");
    }

    vTaskDelay(pdMS_TO_TICKS(1000));
  }
}

